In [21]:
import pandas as pd
import numpy as np
import random

In [22]:
df=pd.DataFrame({'id':[i for i in range(1,11)],
                 'Marks':[23,24,24,np.nan,12,24,np.nan,34,24,57],
                 'Grade':['B','C','A',np.nan,'A','C','D',np.nan,'A','F'],
                 'Gender':[random.choice(['M','F']) for i in range (1,11)]})
df

   id  Marks Grade Gender
0   1   23.0     B      M
1   2   24.0     C      M
2   3   24.0     A      M
3   4    NaN   NaN      M
4   5   12.0     A      M
5   6   24.0     C      F
6   7    NaN     D      F
7   8   34.0   NaN      F
8   9   24.0     A      M
9  10   57.0     F      M

In [23]:
#One Hot Encoding

df['Male']=np.where(df['Gender']=='M',1,0)
df['Female']=np.where(df['Gender']=='F',1,0)
df=df.drop(columns=['Gender'])

In [24]:
df['Grade']=np.where(df['Grade'].isnull(),df['Grade'].mode()[0],df['Grade'])

In [25]:
df['Grade']=np.where(df['Grade']=='F',0,np.where(df['Grade']=='D',1,np.where(df['Grade']=='C',2,np.where(df['Grade']=='B',3,np.where(df['Grade']=='A',4,5)))))
df

   id  Marks  Grade  Male  Female
0   1   23.0      3     1       0
1   2   24.0      2     1       0
2   3   24.0      4     1       0
3   4    NaN      4     1       0
4   5   12.0      4     1       0
5   6   24.0      2     0       1
6   7    NaN      1     0       1
7   8   34.0      4     0       1
8   9   24.0      4     1       0
9  10   57.0      0     1       0

In [26]:
df['Marks']=np.where(df['Marks'].isnull(),df['Marks'].mean(),df['Marks'])

In [27]:
df

   id  Marks  Grade  Male  Female
0   1  23.00      3     1       0
1   2  24.00      2     1       0
2   3  24.00      4     1       0
3   4  27.75      4     1       0
4   5  12.00      4     1       0
5   6  24.00      2     0       1
6   7  27.75      1     0       1
7   8  34.00      4     0       1
8   9  24.00      4     1       0
9  10  57.00      0     1       0